             # Задача 1
        # age = int(input("Возраст: ")) 
        # if age >= 18 and age <= 50: 
        #     print("Доступ разрешен") 
        # elif age > 50: 
        #     print("Вы уже старый") 
        # else: 
        #     print("Иди домой") 

# while True:
#     age = int(input("Возраст: "))
#     age = (print("Доступ разрешен") if age >= 18 and age <= 50 else print("Вы уже старый"))if age > 50 else(print("Доступ разрешен") if age >= 18 and age <= 50 else print("Иди домой")) 
#     print(age)


             # Задача 2
    #     my_passwords = ["qwerty", "12345678"] 
    # user_input = input("Введите пароль: ") 
    # if user_input in my_passwords: 
    #     print("Пароль верный") 
    # else: 
    #     print("Неверный пароль")

# while True:
    # my_passwords = ["qwerty", "12345678"]
    # user_input = input("Введите пароль: ")
    # us = print("Пароль верный") if user_input in my_passwords else print("Неверный пароль")
    # print(us)


             # Задача 2
        # name = input("Ваше имя: ") 
        # names = ["Mark", "Kate", "Anna", "Smit"] 
        # if name in names: 
        #     print(f"{name} в нашем классе") 
        # else: 
        #     print(f"{name} не в нашем классе")

# while True:
#     name = input("Ваше имя: ") 
#     names = ["Mark", "Kate", "Anna", "Smit"]

#     n = print(name,"в нашем классе")if name in names else print(name,  "не в нашем классе")
#     print(n)











































